tap "hashicorp/tap"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "oven-sh/bun"
brew "aws-elasticbeanstalk"
brew "python@3.12"
brew "awscli"
brew "chezmoi"
brew "deno"
brew "icu4c@76"
brew "eslint"
brew "git"
brew "neovim"
brew "nest"
brew "nvm"
brew "pnpm"
brew "telnet"
brew "vercel-cli"
brew "vite"
brew "vue-cli"
brew "yarn"
brew "zsh"
brew "hashicorp/tap/vault"
brew "oven-sh/bun/bun"
cask "chatgpt"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "keyboardcleantool"
cask "ngrok"
cask "postman"
cask "slack"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "alexdima.copy-relative-path"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "compulim.vscode-ipaddress"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "evondev.indent-rainbow-palettes"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "henriiik.docker-linter"
vscode "hollowtree.vue-snippets"
vscode "j69.ejs-beautify"
vscode "johnpapa.angular-essentials"
vscode "josee9988.minifyall"
vscode "magnobiet.docker-extension-pack"
vscode "misterj.vue-volar-extention-pack"
vscode "mkxml.vscode-filesize"
vscode "moppitz.vscode-extension-auto-import"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.vscode-typescript-next"
vscode "nicholashsiang.vscode-pinia-snippets"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "oven.bun-vscode"
vscode "p1c2u.docker-compose"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "sdras.vue-vscode-extensionpack"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "simonsiefke.svg-preview"
vscode "softwaredotcom.swdc-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "sysoev.language-stylus"
vscode "tamasfe.even-better-toml"
vscode "taodongwu.ejs-snippets"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "vuetifyjs.vuetify-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "zh9528.file-size"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
